barnacle_man/app/controllers/epicenter_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def following
    @user = User.find(params[:id])
    @users = []

    User.all.each do |user|
      if @user.following.include?(user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "---\n- 1\n"], ["updated_at", "2018-06-14 01:06:24.648774"], ["id", 2]]
---
  def followers
    @user =  User.find(params[:id])
    @users = []

    User.all.each do |user|
      if user.following.include?(@user.id)
        @users.push(user)

SELECT "users".* FROM "users"
---
  def all_users
    @users = User.all

SELECT "tweets".* FROM "tweets"
---
  def feed
  	@following_tweets = []

    Tweet.all.each do |tweet|

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show_user
  	@user = User.find(params[:id])

UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", nil], ["updated_at", "2018-06-20 23:50:46.570806"], ["id", 2]]
---
  def now_following
  	current_user.following.push(params[:id].to_i)

UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", nil], ["updated_at", "2018-06-14 01:04:44.258712"], ["id", 2]]
---
  def unfollow
  	current_user.following.delete(params[:id].to_i)
  	current_user.save